/*
1)  Напишите SQL запрос который возвращает имена студентов и их аккаунт
    в Telegram у которых родной город “Казань” или “Москва”. Результат
    отсортируйте по имени студента в убывающем порядке
*/
SELECT name, telegram_contact FROM "veronikanenyuk".student
WHERE city IN ('Казань','Москва')
ORDER BY name DESC;

/*
2)  Напишите SQL запрос который возвращает название online курсов
    университетов и количество заявленных слушателей. Количество
	заявленных слушателей на курсе должно быть в диапазоне от 27 до 310
	студентов. Результат отсортируйте по названию курса и по количеству
	заявленных слушателей в убывающем порядке для двух полей.
*/
SELECT name, amount_of_students FROM "veronikanenyuk".course 
WHERE is_online AND amount_of_students BETWEEN 27 AND 310
ORDER BY name DESC, amount_of_students DESC;

/*
3) Напишите SQL запрос который возвращает список университетов и
количество студентов, если идентификатор университета НЕ должен
соответствовать значениям из списка 10, 30, 50. Пожалуйста в основе
примените конструкцию IN. Результат запроса отсортируйте по
количеству студентов И затем по наименованию университета.
*/
SELECT name, size FROM "veronikanenyuk".college
WHERE id NOT IN (10, 30, 50)
ORDER BY size, name;

/*
4) Напишите SQL запрос который возвращает данные по университетам в
следующем виде (один столбец со всеми данными внутри) с сортировкой
по полю “полная информация”
*/
SELECT 'университет: ' || name || '; количество студентов: ' || size "полная информация"
FROM "veronikanenyuk".college ORDER BY 1;

/*
5) Напишите SQL запрос который возвращает название курса и количество
заявленных студентов в отсортированном списке по количеству
слушателей в возрастающем порядке, НО запись с количеством
слушателей равным 300 должна быть на первом месте. Ограничьте вывод данных до 3 строк.
*/
SELECT name, amount_of_students FROM "veronikanenyuk".course
ORDER BY CASE WHEN amount_of_students = 300 THEN 1 ELSE 0 END DESC, amount_of_students ASC
LIMIT 3;